; ModuleID = 'bc/Hash/blake2b.bc'
source_filename = "Hash/blake2b.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.anon = type { i64 }
%union.anon.0 = type { i64 }
%union.anon.1 = type { i64 }
%struct.blake2b_ctx_st = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64 }
%struct.blake2b_param_st = type { i8, i8, i8, i8, [4 x i8], [8 x i8], i8, i8, [14 x i8], [16 x i8], [16 x i8] }

@memset_func = internal global i8* (i8*, i32, i64)* @memset, align 8, !dbg !0
@.str = private unnamed_addr constant [5 x i8] c"mark\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [15 x i8] c"Hash/blake2b.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [30 x i8] c"datalen <= BLAKE2B_BLOCKBYTES\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"Hash/blake2b.c\00", align 1
@__PRETTY_FUNCTION__.BLAKE2b_Update = private unnamed_addr constant [56 x i8] c"int BLAKE2b_Update(BLAKE2B_CTX *, const void *, size_t)\00", align 1
@__const.main.ibuf = private unnamed_addr constant [17 x i8] c"compute,blake2b!\00", align 16
@__const.main.charset = private unnamed_addr constant [94 x i8] c"!#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~\00", align 16
@__const.store32.is_endian = private unnamed_addr constant %union.anon { i64 1 }, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "memset_func", scope: !2, file: !3, line: 55, type: !30, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "Hash/blake2b.c", directory: "/home/phil/Documents/github/cache-symbolic/crypto_test")
!4 = !{}
!5 = !{!6, !7, !12, !14}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 37, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !8, line: 27, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 44, baseType: !16)
!16 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!17 = !{!0, !18, !24}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !2, file: !3, line: 24, type: !20, isLocal: true, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !22)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!22 = !{!23}
!23 = !DISubrange(count: 8)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !2, file: !3, line: 32, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1536, elements: !27)
!27 = !{!28, !29}
!28 = !DISubrange(count: 12)
!29 = !DISubrange(count: 16)
!30 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "memset_t", file: !3, line: 53, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !35, !36, !37}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 46, baseType: !16)
!38 = !DIFile(filename: "Tools/LLVM/llvm-10.0.0/build/lib/clang/10.0.0/include/stddef.h", directory: "/home/phil")
!39 = !{i32 7, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{!"clang version 10.0.0 "}
!43 = distinct !DISubprogram(name: "OPENSSL_cleanse", scope: !3, file: !3, line: 57, type: !44, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !35, !37}
!46 = !DILocalVariable(name: "ptr", arg: 1, scope: !43, file: !3, line: 57, type: !35)
!47 = !DILocation(line: 57, column: 28, scope: !43)
!48 = !DILocalVariable(name: "len", arg: 2, scope: !43, file: !3, line: 57, type: !37)
!49 = !DILocation(line: 57, column: 40, scope: !43)
!50 = !DILocation(line: 59, column: 5, scope: !43)
!51 = !DILocation(line: 59, column: 17, scope: !43)
!52 = !DILocation(line: 59, column: 25, scope: !43)
!53 = !DILocation(line: 60, column: 1, scope: !43)
!54 = distinct !DISubprogram(name: "BLAKE2b_Init", scope: !3, file: !3, line: 96, type: !55, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!55 = !DISubroutineType(types: !56)
!56 = !{!36, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLAKE2B_CTX", file: !59, line: 82, baseType: !60)
!59 = !DIFile(filename: "Hash/blake2_local.h", directory: "/home/phil/Documents/github/cache-symbolic/crypto_test")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_ctx_st", file: !59, line: 70, size: 1856, elements: !61)
!61 = !{!62, !64, !68, !69, !73}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !60, file: !59, line: 71, baseType: !63, size: 512)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !22)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !60, file: !59, line: 72, baseType: !65, size: 128, offset: 512)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 128, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 2)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !60, file: !59, line: 73, baseType: !65, size: 128, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !60, file: !59, line: 74, baseType: !70, size: 1024, offset: 768)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !60, file: !59, line: 75, baseType: !37, size: 64, offset: 1792)
!74 = !DILocalVariable(name: "S", arg: 1, scope: !75, file: !3, line: 69, type: !57)
!75 = distinct !DISubprogram(name: "blake2b_init0", scope: !3, file: !3, line: 69, type: !76, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !57}
!78 = !DILocation(line: 69, column: 52, scope: !75, inlinedAt: !79)
!79 = distinct !DILocation(line: 84, column: 5, scope: !80, inlinedAt: !108)
!80 = distinct !DISubprogram(name: "blake2b_init_param", scope: !3, file: !3, line: 80, type: !81, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !57, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLAKE2B_PARAM", file: !59, line: 68, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_param_st", file: !59, line: 54, size: 512, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !96, !98, !99, !100, !104, !107}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "digest_length", scope: !86, file: !59, line: 55, baseType: !7, size: 8)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "key_length", scope: !86, file: !59, line: 56, baseType: !7, size: 8, offset: 8)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "fanout", scope: !86, file: !59, line: 57, baseType: !7, size: 8, offset: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !86, file: !59, line: 58, baseType: !7, size: 8, offset: 24)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "leaf_length", scope: !86, file: !59, line: 59, baseType: !93, size: 32, offset: 32)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 4)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "node_offset", scope: !86, file: !59, line: 60, baseType: !97, size: 64, offset: 64)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !22)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "node_depth", scope: !86, file: !59, line: 61, baseType: !7, size: 8, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "inner_length", scope: !86, file: !59, line: 62, baseType: !7, size: 8, offset: 136)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !86, file: !59, line: 63, baseType: !101, size: 112, offset: 144)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 14)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "salt", scope: !86, file: !59, line: 64, baseType: !105, size: 128, offset: 256)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !106)
!106 = !{!29}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "personal", scope: !86, file: !59, line: 65, baseType: !105, size: 128, offset: 384)
!108 = distinct !DILocation(line: 110, column: 5, scope: !54)
!109 = !DILocalVariable(name: "i", scope: !75, file: !3, line: 71, type: !36)
!110 = !DILocation(line: 71, column: 9, scope: !75, inlinedAt: !79)
!111 = !DILocalVariable(name: "S", arg: 1, scope: !80, file: !3, line: 80, type: !57)
!112 = !DILocation(line: 80, column: 45, scope: !80, inlinedAt: !108)
!113 = !DILocalVariable(name: "P", arg: 2, scope: !80, file: !3, line: 80, type: !83)
!114 = !DILocation(line: 80, column: 69, scope: !80, inlinedAt: !108)
!115 = !DILocalVariable(name: "i", scope: !80, file: !3, line: 82, type: !37)
!116 = !DILocation(line: 82, column: 12, scope: !80, inlinedAt: !108)
!117 = !DILocalVariable(name: "p", scope: !80, file: !3, line: 83, type: !12)
!118 = !DILocation(line: 83, column: 20, scope: !80, inlinedAt: !108)
!119 = !DILocalVariable(name: "c", arg: 1, scope: !54, file: !3, line: 96, type: !57)
!120 = !DILocation(line: 96, column: 31, scope: !54)
!121 = !DILocalVariable(name: "P", scope: !54, file: !3, line: 98, type: !122)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DILocation(line: 98, column: 19, scope: !54)
!126 = !DILocation(line: 99, column: 8, scope: !54)
!127 = !DILocation(line: 99, column: 22, scope: !54)
!128 = !DILocation(line: 100, column: 8, scope: !54)
!129 = !DILocation(line: 100, column: 22, scope: !54)
!130 = !DILocation(line: 101, column: 8, scope: !54)
!131 = !DILocation(line: 101, column: 22, scope: !54)
!132 = !DILocation(line: 102, column: 8, scope: !54)
!133 = !DILocation(line: 102, column: 22, scope: !54)
!134 = !DILocation(line: 103, column: 16, scope: !54)
!135 = !DILocation(line: 103, column: 13, scope: !54)
!136 = !DILocation(line: 103, column: 5, scope: !54)
!137 = !DILocation(line: 104, column: 16, scope: !54)
!138 = !DILocation(line: 104, column: 13, scope: !54)
!139 = !DILocation(line: 104, column: 5, scope: !54)
!140 = !DILocation(line: 105, column: 8, scope: !54)
!141 = !DILocation(line: 105, column: 22, scope: !54)
!142 = !DILocation(line: 106, column: 8, scope: !54)
!143 = !DILocation(line: 106, column: 22, scope: !54)
!144 = !DILocation(line: 107, column: 15, scope: !54)
!145 = !DILocation(line: 107, column: 5, scope: !54)
!146 = !DILocation(line: 108, column: 15, scope: !54)
!147 = !DILocation(line: 108, column: 5, scope: !54)
!148 = !DILocation(line: 109, column: 15, scope: !54)
!149 = !DILocation(line: 109, column: 5, scope: !54)
!150 = !DILocation(line: 110, column: 24, scope: !54)
!151 = !DILocation(line: 110, column: 27, scope: !54)
!152 = !DILocation(line: 83, column: 42, scope: !80, inlinedAt: !108)
!153 = !DILocation(line: 83, column: 24, scope: !80, inlinedAt: !108)
!154 = !DILocation(line: 84, column: 19, scope: !80, inlinedAt: !108)
!155 = !DILocation(line: 73, column: 12, scope: !75, inlinedAt: !79)
!156 = !DILocation(line: 73, column: 5, scope: !75, inlinedAt: !79)
!157 = !DILocation(line: 74, column: 12, scope: !158, inlinedAt: !79)
!158 = distinct !DILexicalBlock(scope: !75, file: !3, line: 74, column: 5)
!159 = !DILocation(line: 74, column: 10, scope: !158, inlinedAt: !79)
!160 = !DILocation(line: 74, column: 17, scope: !161, inlinedAt: !79)
!161 = distinct !DILexicalBlock(scope: !158, file: !3, line: 74, column: 5)
!162 = !DILocation(line: 74, column: 19, scope: !161, inlinedAt: !79)
!163 = !DILocation(line: 74, column: 5, scope: !158, inlinedAt: !79)
!164 = !DILocation(line: 75, column: 30, scope: !165, inlinedAt: !79)
!165 = distinct !DILexicalBlock(scope: !161, file: !3, line: 74, column: 29)
!166 = !DILocation(line: 75, column: 19, scope: !165, inlinedAt: !79)
!167 = !DILocation(line: 75, column: 9, scope: !165, inlinedAt: !79)
!168 = !DILocation(line: 75, column: 12, scope: !165, inlinedAt: !79)
!169 = !DILocation(line: 75, column: 14, scope: !165, inlinedAt: !79)
